'🍟==============================『🍗 ʏօʊȶʊɮɛʟɨ 🍰』==============================🍟'
from pyrogram import (
    Client as mapple,
    idle
    )
from IDLER.Trial import *
'🍟==============================『🍗 ʏօʊȶʊɮɛʟɨ 🍰』==============================🍟'
ƈǟʟɨȶʀօռӼ = mapple(
    session_name=VOIDED,
    bot_token=TOKEN,
    api_id=APP_ID,
    api_hash=API_HASH,
    plugins=plugins,
    workers=CPCCNT
    )
'🍟==============================『🍗 ʏօʊȶʊɮɛʟɨ 🍰』==============================🍟'
ƈǟʟɨȶʀօռӼ.start()
idle()
ƈǟʟɨȶʀօռӼ.stop()
'🍟==============================『🍗 ʏօʊȶʊɮɛʟɨ 🍰』==============================🍟'